== User Defined sc Neo4j Functions - Procedures

=== Setup

- edit neo4j.conf and add  sc.*  e.g.: 

[source,neo4j.conf]
----
vi /etc/neo4j/neo4j.conf
...
dbms.security.procedures.unrestricted=apoc.*,sc.*
dbms.security.procedures.whitelist=apoc.*,sc.*
----
- copy sc-neo4j-3.5.x.x.jar to Neo4j plugins directory e.g.:

[source,bash]
----
cp ./sc-neo4j-3.5.x.x.jar /var/lib/neo4j/plugins
----
- restart neo4j services
[source,bash]
----
service neo4j restart
----

- check for sc.xxxx.xxx with: 
[source,cypher]
----
CALL dbms.functions()
CALL dbms.procedures()
----

- loggging: 
[source,bash]
----
# check dbms.logs.debug.level in the neo4j.conf - set to DEBUG
tail -f /var/log/neo4j/debug.log
----


===  Logging from CYPHER to Neo4j system log
==== sc.log.info - function
sc.log.info('logString',logObject) +
- log to Neo4j system log: /var/log/neo4j/debug.log  +
- logObject is returned +
- logObject can be node, ralation, map  +

====== Example
[source,cypher]
----
CREATE (n:test {propKeyString:"string, propkeyInt:123})
WITH n AS testNode
WITH sc.log.info('test node: ',testNode) AS testNodeFromLog
RETURN testNodeFromLog
----
[source,cypher]
----
tail -f /var/log/neo4j/debug.log

2019-01-17 12:31:10.435+0000 INFO [o.n.k.i.p.Procedures] sc.log: test node:  {"propKeyString":"string","propkeyInt":123}

----




=== http post
==== sc.rest.urlEncodeString - function
sc.rest.urlEncodeString('string') +
- return url encoded string

====== Example
[source,cypher]
----
RETURN sc.rest.urlEncodeString('aaa.bbb@email.com {jsonString:"!"#$&/()"}') AS urlEncodeString
----
[source,cypher]
----
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+"urlEncodeString"                                                     +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+"aaa.bbb%40email.com+%7BjsonString%3A%22%21%22%23%24%26%2F%28%29%22%7D+
+"                                                                     +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
----


==== sc.rest.jsonPost - function
Run http/https json post and receive response from REST - based on Apache HttpComponents!

JSON POST request +
- sc.rest.jsonPost("urlString", {json document}, options) - return json document + 
- sc.rest.jsonPost("urlString", neo4jNode, options) - return json document +
- sc.rest.jsonPost("urlString", neo4jRelationship, options) - return json document +

options
[source,node.js]
----
{ 
 enableInsecureHttps: true/false,
 enableErrorMessage: true/false
} 
----
====== Example
node.js REST server
[source,node.js]
----
var express = require('express')
var http = require('http');
var https = require('https');
var bodyParser = require('body-parser');
var fs = require('fs');

var app = express();
app.use(bodyParser.json());
http.createServer(app).listen(80);
console.log("http server started port 8080 - https 8443")

var pk = fs.readFileSync(__dirname+'\\server.key', 'utf8');
var pc = fs.readFileSync(__dirname+'\\server.crt', 'utf8');
var httpsOptions = {
    key: pk,
    cert: pc,
    secureProtocol: "TLSv1_2_method"
};

https.createServer(httpsOptions, app).listen({port: 8443}); 
http.createServer(app).listen(8080);

app.post('/restTest', function (req, res) {
    console.log('/restTest', req)
    var responseJson = {
        "error": null,
        "string": "string",
        "boolean": true,
        "integer": 123,
        "float": 123.456,
        "object": {
            "string": "string",
            "boolean": true,
            "integer": 123
        },
        array: ["string", true, 123, 123.456, {
                "string": "string",
                "boolean": true,
                "integer": 123
            }],
        "request": req.body,
    }
    res.json(responseJson);
});
----
httpPostJson
[source,cypher]
----
RETURN sc.rest.jsonPost("http://127.0.0.1:8080/restTest", {name:123}) AS postResponse
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+"postResponse"                                                        +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+{"request":{"name":123.0},"boolean":true,"string":"string","array":["s+
+tring",true,123.0,123.456,{"string":"string","boolean":true,"integer":+
+123.0}],"integer":123.0,"error":null,"float":123.456,"object":{"string+
+":"string","boolean":true,"integer":123.0}}                           +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
----

[source,cypher]
----
WITH sc.rest.jsonPost("https://127.0.0.1:8443/restTest", {name:123},{enableInsecureHttps: true, enableErrorMessage:true}) AS postResponse 
RETURN postResponse.array
----



https options
[source,cypher]
----
RETURN sc.rest.jsonPost("https://127.0.0.1:8443/restTest", {name:123}) AS postResponse
++++++++++++++++
+"postResponse"+
++++++++++++++++
+null          +
++++++++++++++++
----


[source,cypher]
----
RETURN sc.rest.jsonPost("https://127.0.0.1:8443/restTest", {name:123},{enableInsecureHttps: true}) AS postResponse
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+"postResponse"                                                        +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+{"request":{"name":123.0},"boolean":true,"string":"string","array":["s+
+tring",true,123.0,123.456,{"string":"string","boolean":true,"integer":+
+123.0}],"integer":123.0,"error":null,"float":123.456,"object":{"string+
+":"string","boolean":true,"integer":123.0}}                           +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
----

error handling
[source,cypher]
RETURN sc.rest.jsonPost("https://127.0.0.1:8443/restTest", {name:123},{enableInsecureHttps: false, enableErrorMessage:false}) AS postResponse
++++++++++++++++
+"postResponse"+
++++++++++++++++
+null          +
++++++++++++++++
----


[source,cypher]
----
RETURN sc.rest.jsonPost("https://127.0.0.1:8443/restTest", {name:123},{enableInsecureHttps: false, enableErrorMessage:true}) AS postResponse
+++++++++++++++++++++++++
+"postResponse"         +
+++++++++++++++++++++++++
+{"error":"IOException"}+
+++++++++++++++++++++++++
----

==== httpPostNode - function
[source,cypher]
----
MATCH (n:scTestNode) DETACH DELETE n;
CREATE (n:scTestNode {string:"string", integer:123, boolean:true, float:123.456}) RETURN n;

MATCH (n:scTestNode)
RETURN sc.rest.jsonPost(
   "http://127.0.0.1/restTest", 
   n,
   {enableInsecureHttps: false, enableErrorMessage:false}
) 
AS postResponseNode
----
[source,cypher]
----
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+"postResponseNode"                                                    +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+{"request":{"boolean":true,"integer":123.0,"string":"string","float":1+
+23.456},"boolean":true,"string":"string","array":["string",true,123.0,+
+123.456,{"string":"string","boolean":true,"integer":123.0}],"integer":+
+123.0,"error":null,"float":123.456,"object":{"string":"string","boolea+
+n":true,"integer":123.0}}                                             +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
----

==== httpPostRelationship - function
[source,cypher]
----
MATCH ()-[r:scTesttRelationship]->() DELETE r
CREATE (:scTestNode)-[r:scTesttRelationship {string:"string", integer:123, boolean:true, float:123.456}]->(:scTestNode) RETURN r

MATCH ()-[r:scTesttRelationship]->()  
RETURN sc.rest.jsonPost("http://127.0.0.1/restTest", r) AS postResponseRelationship
----
[source,cypher]
----
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+"postResponseRelationship"                                            +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+{"request":{"boolean":true,"integer":123.0,"string":"string","float":1+
+23.456},"boolean":true,"string":"string","array":["string",true,123.0,+
+123.456,{"string":"string","boolean":true,"integer":123.0}],"integer":+
+123.0,"error":null,"float":123.456,"object":{"string":"string","boolea+
+n":true,"integer":123.0}}                                             +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
----


==== sc.rest.jsonRpc2 - function
Run http/https json RPC post and receive response from jsonRpc2 REST  server - based on Apache HttpComponents!

JSON POST request +
- sc.rest.jsonRpc2("urlString", "rpcMethod", {json: "document"}, options) - return json document + 


options
[source,node.js]
----
{ 
 enableInsecureHttps: true/false,
 enableErrorMessage: true/false
} 
----
====== Example
[source,cypher]
----
RETURN sc.rest.jsonRpc2('https://10.20.20.13:10443/jsonRpc2RestPost', 'pingIpAddress', {ipAddress:'8.8.8.8'},{enableInsecureHttps: true, enableErrorMessage:true}) AS pingResponse
----
[source,cypher]
----
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+"pingResponse"                                                        +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
│{"pingStatusOK":true,"rttAvgMs":9.473,"jitterMdevMs":null,"testMetaDat│
│a":{"pingStatusOK":true,"rttAvgMs":9.473,"jitterMdevMs":0.0,"testReque│
│st":{"ipAddress":"8.8.8.8","pingInterval":1.0,"mtuCheck":" ","pingPack│
│etSize":56.0,"execShellCommandRequest":{"command":"ping -c 1 -i 1  -s5│
│6 8.8.8.8  |grep 'rtt\|transmitted'","timeoutSec":12.0},"pingCount":1.│
│0},"jitterMinMaxMs":0.0,"pingStatus":"up","packetLossPercent":0.0,"rtt│
│MaxMs":9.473,"rttMinMs":9.473},"jitterMinMaxMs":null,"error":null,"pin│
│gStatus":"up","packetLossPercent":0.0,"rttMaxMs":9.473,"rttMinMs":9.47│
│3}
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
----

=== Cypher

==== Cypher Neo4j Java VM - functions/procedures
Store cypher query into Neo4j Java VM and run query when needed

- sc.cypher.addVm('name', 'cypher query', {cypher query parameters}) - add CYPHER Java VM calls
- sc.cypher.listVm() - list all CYPHER java VM calls
- sc.cypher.runProcedureVm("stringFunctionName", {object:"params"} - run CYPHER from Java VM
- sc.cypher.deleteVm('name') - add CYPHER Java VM calls


====== Example
Add  queries:
[source,cypher]
----
RETURN sc.cypher.addVm('addTestNode', 'CREATE (n:scTestNode) SET n.name=$name RETURN n')
RETURN sc.cypher.addVm('listAllTestNodes', 'MATCH (n:scTestNode) RETURN n')
RETURN sc.cypher.addVm('deleteAllTestNodes', 'MATCH (n:scTestNode) DETACH DELETE n')

RETURN sc.cypher.listVm()
----
Use  queries:
[source,cypher]
----
CALL sc.cypher.runVm('addTestNode', {name:"nd01"})
CALL sc.cypher.runVm('addTestNode', {name:"nd02"})
CALL sc.cypher.runVm('addTestNode', {name:"nd03"})

CALL sc.cypher.runVm('listAllTestNodes', {name:"nd03"})

CALL sc.cypher.runVm('deleteAllTestNodes', {})
CALL sc.cypher.runVm('listAllTestNodes', {name:"nd03"})
----
Remove  queries:
[source,cypher]
----
RETURN sc.cypher.listVm()
RETURN sc.cypher.deleteVm('deleteAllTestNodes')
RETURN sc.cypher.listVm()
RETURN sc.cypher.deleteVm('addTestNode')
RETURN sc.cypher.deleteVm('listAllTestNodes')
RETURN sc.cypher.listVm()
----



==== Cypher Neo4j DB - functions/procedures
Store cypher query into Neo4j DB as nodes and run query when needed

- sc.cypher.addDb('name', 'cypher query', {cypher query parameters}) - add CYPHER Java VM calls
- sc.cypher.listDb() - list all CYPHER java VM calls
- sc.cypher.runProcedureDb('stringFunctionName', {object:'params'} - run CYPHER from Java VM
- sc.cypher.deleteDb('name') - add CYPHER Java VM calls


====== Example
Add  queries:
[source,cypher]
----
CALL sc.cypher.addDb('addTestNode', 'CREATE (n:scTestNode) SET n.name=$name RETURN n')
CALL sc.cypher.addDb('listAllTestNodes', 'MATCH (n:scTestNode) RETURN n')
CALL sc.cypher.addDb('deleteAllTestNodes', 'MATCH (n:scTestNode) DETACH DELETE n')

RETURN sc.cypher.listDb()
----
Use  queries:
[source,cypher]
----
CALL sc.cypher.runDb('listAllTestNodes', {name:"nd03"})

CALL sc.cypher.runDb('addTestNode', {name:"nd01"})
CALL sc.cypher.runDb('addTestNode', {name:"nd02"})
CALL sc.cypher.runDb('addTestNode', {name:"nd03"})

CALL sc.cypher.runDb('listAllTestNodes', {name:"nd03"})

CALL sc.cypher.runDb('deleteAllTestNodes', {})
CALL sc.cypher.runDb('listAllTestNodes', {name:"nd03"})
----
Remove  queries:
[source,cypher]
----
RETURN sc.cypher.listDb()
CALL sc.cypher.deleteDb('deleteAllTestNodes')
RETURN sc.cypher.listDb()
CALL sc.cypher.deleteDb('addTestNode')
CALL sc.cypher.deleteDb('listAllTestNodes')
RETURN sc.cypher.listDb()
----



cypher node management
[source,cypher]
----
// find CypherRunDb
MATCH (n:CypherRunDb) 
RETURN n
----
[source,cypher]
----
// delete all CypherRunDb
MATCH (n:CypherRunDb) 
DETACH DELETE n
----
==== Cypher Neo4j VM - DB Examples
====== example - string return

[source,cypher]
----
// create 
CREATE (n:CypherRunDb) 
SET 
    n.name="stringFunction",
    n.type="CypherRunDb",  
    n.query= "RETURN \"string from query\" AS string" 
RETURN n
----
[source,cypher]
----
// check 
MATCH (n:CypherRunDb) 
WHERE n.name="stringFunction"
RETURN n
----
[source,cypher]
----
// run
CALL sc.cypher.runDb("stringFunction", {}) 
----


====== example - url creating 

[source,cypher]
----
// create 
RETURN sc.cypher.addVm("getUrl", "RETURN \"http://:\" + $ipAddress + \"/\"+ $restMethod AS url")

----
[source,cypher]
----
// run
CALL sc.cypher.runVm("getUrl", {ipAddress:"127.0.0.1",restMethod:"testPost"})
----


====== example - search nodes with parameters

[source,cypher]
----
CREATE (n:person) SET n.name="abc";
CREATE (n:person) SET n.name="def";
CREATE (n:person) SET n.name="ghi";

RETURN sc.cypher.addVm("findPerson", "MATCH (n:person) WHERE n.name=$name RETURN n")
----

[source,cypher]
----
// run
CALL sc.cypher.runVm("findPerson", {name:"abc"})
----


==== Cypher Neo4j CRON - functions/procedures
Run cypher query by cron schedule - based on cron4j library.

Managing CRON Neo4j nodes + 
[source,cypher]
----
CALL sc.cron.addCronNode('cronName','* * * * *','MERGE (n:testNode) SET n.timestamp=timestamp() RETURN n', {cypherQueryParams:'optional'},{cronScheduler:'optional', cronDelay:0})
RETURN sc.cron.listCronNodes() 
CALL sc.cron.deleteCronNode('cronName') 

CALL sc.cron.startCronNode('cronName') 
CALL sc.cron.stopCronNode('cronName')
----

Managing CRON Neo4j from Java VM + 
[source,cypher]
----
RETURN sc.cron.addVm('cronName','* * * * *','MATCH (n) RETURN n', {cypherQueryParams:'optional'},{cronScheduler:'optional', cronDelay:0})
RETURN sc.cron.deleteVm('cronName')
----

Managing CRON Neo4j tasks
[source,cypher]
----
RETURN sc.cron.listRunning() 
RETURN sc.cron.listRunningAsVnode() 
----

Run CRON Neo4j task
[source,cypher]
----
CALL sc.cron.runCronNode('cronName')
----
====== Example
Add  CRON task:
[source,cypher]
----
WITH "MERGE (n:CronNode  ) ON CREATE SET n.created = timestamp(), n.count = 1 ON MATCH SET n.update = timestamp(), n.count = n.count+1 RETURN n" AS createTestNode 
CALL sc.cron.addCronNode('cronName','* * * * *',createTestNode) YIELD value AS cronAdd
RETURN cronAdd

╒══════════════════════════════════════════════════════════════════════╕
│"cronAdd"                                                             │
╞══════════════════════════════════════════════════════════════════════╡
│{"n":{"cypherQuery":"MERGE (n:CronNode  ) ON CREATE SET n.created = ti│
│mestamp(), n.count = 1 ON MATCH SET n.update = timestamp(), n.count = │
│n.count+1 RETURN n","cronStatus":"initialized ","cronString":"* * * * │
│*","cypherParams":"{}","name":"cronName","cronParams":"{"cronDelay":0}│
│","type":"CronRunDb"}}                                                │
└──────────────────────────────────────────────────────────────────────┘



----

Start Neo4j CRON node tasks.
[source,cypher]
----
CALL sc.cron.startCronNode('cronName')
╒══════════════════════════════════════════════════════════════════════╕
│"value"                                                               │
╞══════════════════════════════════════════════════════════════════════╡
│{"n":[{"cypherQuery":"MERGE (n:CronNode  ) ON CREATE SET n.created = t│
│imestamp(), n.count = 1 ON MATCH SET n.update = timestamp(), n.count =│
│ n.count+1 RETURN n","cronStatus":"running","cronString":"* * * * *","│
│cypherParams":"{}","name":"cronName","cronParams":"{"cronDelay":0}","t│
│ype":"CronRunDb"}]}                                                   │
└──────────────────────────────────────────────────────────────────────┘
----

list running Neo4j CRON node tasks.
[source,cypher]
----
CALL sc.cron.listRunning()
----

Stop Neo4j CRON node tasks.
[source,cypher]
----
CALL sc.cron.stopCronNode('cronName')
----

Delete Neo4j CRON node.
[source,cypher]
----
CALL sc.cron.deleteCronNode('cronName')
----




==== Cypher Neo4j MqTT client - functions/procedures
MqTT publish subscribe from Neo4j - based on org.eclipse.paho.client.mqttv3 library.

Managing  MqTT brokers
[source,cypher]
----
RETURN sc.mqtt.addBroker(
 'mqttBrokerName', 
 {
  brokerUrl:'tcp://iot.eclipse.org:1883', 
  clientId:'123'  
 }
) 
RETURN sc.mqtt.listBrokers()
RETURN sc.mqtt.listBrokersAsVnode()
RETURN sc.mqtt.deleteBroker('mqttBrokerName')
----

MqTT publish
[source,cypher]
----
CALL sc.mqtt.publishValue(
  'mqttBrokerName', 
  '/mqtt/topic/path', 
  'value'
}

CALL sc.mqtt.publishJson(
 'mqttBrokerName', 
 '/mqtt/topic/path', 
 {message:123}
)

CALL sc.mqtt.publishJsonRpc2(
 'graphTravelerMaster', 
 'pingIpAddress', 
 {ipAddress:'10.20.20.13'}
)
----

MqTT subscribe
[source,cypher]
----
CALL sc.mqtt.subscribeValue(
 'mqttBrokerName', 
  '/mqtt/topic/path',
  'MERGE (n:mqttTest) ON CREATE SET n.count=1, n.message=$message ON MATCH SET n.count = n.count +1, n.message=$message '
)

CALL sc.mqtt.subscribeJson(
  'mqttBrokerName', 
  '/mqtt/topic/path',
  'MERGE (n:mqttTest) ON CREATE SET n.count=1, n.message=$message ON MATCH SET n.count = n.count +1, n.message=$message '
)

RETURN sc.mqtt.listBrokersAsVnode()
RETURN sc.mqtt.listSubscriptionsAsVnode()

CALL sc.mqtt.unSubscribeTopic('mqttBrokerName', '/mqtt/topic/path  )
CALL sc.mqtt.unSubscribeJsonRpc2('mqttBrokerName', 'pingIpAddress' )
----


====== Example
Add MqTT broker connection, subscribe to topic and publish:
[source,cypher]
----

----

Check Nodes created by Neo4j MqTT subsciber.
[source,cypher]
----

----

List MqTT broker connections.
[source,cypher]
----

----

Remove MqTT subscription.
[source,cypher]
----

----

[source,cypher]
----
 RETURN sc.mqtt.delete('mqttBrokerName')
----



==== Neo4j commit triggers
Neo4j commit triggers on node propertie update

Managing  MqTT brokers
[source,cypher]
----
RETURN sc.commit.registerNodePropertieTriggerAfter(
 'propertieKey', 
 'MATCH (n) WHERE ID(n)=$id SET n.triggeredAfter=true'
)
RETURN sc.commit.registerNodePropertieTriggerAfter(
 'propertieKey', 
 'MATCH (n) WHERE ID(n)=$id SET n.triggeredAfter=true'
)
 
RETURN sc.commit.listTriggers() 

RETURN sc.commit.registerNodePropertieTriggerBefore('propertieKey') 
RETURN sc.commit.removeNodePropertieTriggerBefore('propertieKey') 

----





===  EVAL JavaScript Neo4j Java VM - function
Run JavaScript via java Nashorn JavaScript engine for the JVM and receive JavaScript response


- sc.javascript.run("javascript script string", jsParams)"  - javascript response          
- sc.javascript.addDb('name', 'cypher query', {cypher query parameters}) - add JavaScript Java VM calls
- sc.javascript.listDb() - list all JavaScript java VM calls
- sc.javascript.runProcedureDb(\"stringFunctionName\", {object:\"params\"} - run JavaScript from Java VM
- sc.javascript.deleteDb('name') - add JavaScript Java VM calls
!!! jsParams  - parameters JavaScript var name!

====== Example run JavaScript
[source,cypher]
----
WITH "
return 'Hello, from javascript with string parameter: ' + jsParams + '!';"
AS javaScriptString

RETURN sc.javascript.run(javaScriptString, "input params string")
----  
[source,cypher]
----
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+"sc.javascript.run(javaScriptString, "input params string")"        +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+"Hello, from javascript with string parameter: input params string!"+
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
----


[source,cypher]
----
WITH "
var properties = JSON.parse(jsParams); 
var replyString = 'return Hello, from javascript with json object params: ' + properties.name + '!';
return replyString;"
AS javaScriptString

WITH "{\"name\":\"abc\", \"address\":\"def 12\"}" AS properties, javaScriptString

RETURN sc.javascript.run(javaScriptString, properties)
----   

[source,cypher]
----
WITH "
var properties = JSON.parse(jsParams); 
var replyObject = {
name:properties.name || 'default',
address:properties.address || 'default' ,
telephone:properties.telephone || 'default' 
};
return replyObject;"
AS checkInputDataJs

WITH "{\"name\":\"abc\", \"address\":\"def 12\"}" AS dataToCheck, checkInputDataJs
WITH  sc.javascript.run(checkInputDataJs, dataToCheck) AS jsResponse

RETURN jsResponse.telephone
----






====== Example register / use JavaScript

Add  javascript:
[source,cypher]
----
WITH "
var properties = JSON.parse(jsParams); 
var replyObject = {
name:properties.name || 'default',
address:properties.address || 'default' ,
telephone:properties.telephone || 'default' 
};
return replyObject;"
AS checkInputDataJs
RETURN sc.javascript.addVm('checkforTelephone', checkInputDataJs)


RETURN sc.javascript.listVm()
----
Use  javascript:
[source,cypher]
----
WITH "{\"name\":\"abc\", \"address\":\"def 12\"}" AS dataToCheck
RETURN sc.javascript.runVm('checkforTelephone', dataToCheck)


WITH "{\"name\":\"abc\", \"telephone\":\"12345 67 12\"}" AS dataToCheck
RETURN sc.javascript.runVm('checkforTelephone', dataToCheck)


RETURN sc.javascript.runVm('checkforTelephone', '{"name":"nd03"}')
----
Remove  javascript:
[source,cypher]
----
RETURN sc.javascript.listVm()
RETURN sc.javascript.deleteVm('checkforTelephone')
RETURN sc.javascript.listVm()
----





=== Export to JSON
==== jsonExportNode - function
- sc.json.jsonExportNode(neo4jNode) - return json Neo4j Node string"


====== Example
[source,cypher]
----
MATCH (n:scTestNode) DETACH DELETE n;
CREATE (n:scTestNode {string:"string", integer:123, boolean:true, float:123.456}) RETURN n;

MATCH (n:scTestNode)  RETURN sc.json.jsonExportNode(n) AS jsonExportNode;
----
[source,cypher]
----
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+"jsonExportNode"                                                      +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+"{_id:83,_labels:[scTestNode],_properties:{"boolean":true,"string":"st+
+ring","integer":123,"float":123.456}}"                                +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
----

==== jsonExportRelationship - function
- sc.jsonExportRelationship(neo4jRelationship) - return json Neo4j Relationship string"

====== Example
[source,cypher]
----
MATCH ()-[r:scTesttRelationship]->() DELETE r
CREATE (:scTestNode)-[r:scTesttRelationship {string:"string", integer:123, boolean:true, float:123.456}]->(:scTestNode) RETURN r

MATCH ()-[r:scTesttRelationship]->()  RETURN sc.json.jsonExportRelationship(r) AS jsonExportRelationship
----
[source,cypher]
----
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+"jsonExportRelationship"                                              +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+"{_id:33,_from:232,_to:233,_type:scTesttRelationship,_properties:{"boo+
+lean":true,"string":"string","integer":123,"float":123.456}}"         +
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
----


